//&SYSUID  JOB (ACCT#),'ALLINONE',MSGCLASS=H,REGION=4M,
//             CLASS=A,MSGLEVEL=(0,0),NOTIFY=&SYSUID,TIME=(0,5),
//             COND=(4,LT)
//             JCLLIB ORDER=(SDJ.FORM.PROCLIB)
//*
//*
//* ================================
//* 3) ESDS : DELETE + SORT + DEFINE + REPRO
//*    (reprend ton JCL "ESDS")
//* ================================
//ESDSD1   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE &SYSUID..SEQ.MVTSRI
  IF LASTCC LE 8 THEN SET MAXCC = 0
/*
//ESDSSRT  EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=&SYSUID..SEQ.MVTS,DISP=SHR
//SORTOUT  DD DSN=&SYSUID..SEQ.MVTSRI,DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(5,2)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSIN    DD *
  SORT FIELDS=(1,6,ZD,A,62,18,CH,A)
/*
//ESDSD2   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE (&SYSUID..ESDS.MVTS) CLUSTER PURGE
  SET MAXCC = 0
  DEFINE CLUSTER (NAME(&SYSUID..ESDS.MVTS) -
                  TRACKS(1 1) -
                  NONINDEXED -
                  RECSZ(80,80))
  REPRO INDATASET(&SYSUID..SEQ.MVTSRI) -
        OUTDATASET(&SYSUID..ESDS.MVTS)
  PRINT INDATASET(&SYSUID..SEQ.MVTSRI)
/*
//*
//* ================================
//* 4) KSDS : DELETE SEQ + SORT + DEFINE KSDS + REPRO
//*    (reprend ton JCL "DELDEF")
//* ================================
//KSDSD1   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE &SYSUID..SEQ.ASSUREST
  IF LASTCC LE 8 THEN SET MAXCC = 0
/*
//KSDSSRT  EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=&SYSUID..SEQ.ASSURES,DISP=SHR
//SORTOUT  DD DSN=&SYSUID..SEQ.ASSUREST,DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=80)
//SYSIN    DD *
  SORT FIELDS=(1,6,ZD,A,27,18,CH,A)
/*
//KSDSD2   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE (&SYSUID..KSDS.ASSURES) CLUSTER
  IF LASTCC LE 8 THEN SET MAXCC = 0
  DEFINE CLUSTER (NAME(&SYSUID..KSDS.ASSURES) -
                  TRACKS(1 1) -
                  VOLUME(AJCUK1) -
                  INDEXED -
                  KEY(6 0) -
                  RECORDSIZE(80 80) -
                  FREESPACE(40 40)) -
                  DATA (NAME(&SYSUID..KSDS.ASSURES.DATA)) -
                  INDEX (NAME(&SYSUID..KSDS.ASSURES.INDEX))
  REPRO INDATASET(&SYSUID..SEQ.ASSUREST) -
        OUTDATASET(&SYSUID..KSDS.ASSURES)
/*
//COMPIL1      EXEC COMPCOB,NOMPGM=ACCFIC
//STEPCOB.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//               DD DSN=&SYSUID..COB.CPY,DISP=SHR
/*
//COMPIL2      EXEC COMPCOB,NOMPGM=MAJASSUR
//STEPCOB.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//               DD DSN=&SYSUID..COB.CPY,DISP=SHR
/*
//*
//* ================================
//* 5) EXECUTION PROGRAMME
//* ================================
//RUN      EXEC PGM=MAJASSUR
//STEPLIB  DD DSN=&SYSUID..COB.LOAD,DISP=SHR
//MVTS     DD DSN=&SYSUID..ESDS.MVTS,DISP=SHR
//ETATNO   DD DSN=&SYSUID..SEQ.ETATNO,DISP=SHR
//STAT     DD DSN=&SYSUID..SEQ.STAT,DISP=SHR
//ASSURES  DD DSN=&SYSUID..KSDS.ASSURES,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
/*
